import React from 'react'

const Arrays = () => {
  return (
    <>
    <ul>
      <li>
        <p>
          Створи функцію, яка приймає масив чисел і повертає масив з тими ж
          числами, але відсортованими в порядку зростання.
        </p>
        <code className="code">[]</code>
      </li>

      <li>
        Створи функцію, яка приймає рядок і повертає новий рядок, у якому перша
        літера кожного слова замінена на велику.
      </li>

      <li>
        Створи функцію, яка приймає масив об'єктів і повертає новий масив, в
        якому тільки ті об'єкти, властивість "age" яких більше або рівна 18.
      </li>

      <li>
        Створи функцію, яка приймає масив чисел і повертає середнє арифметичне
        цих чисел.
      </li>

      <li>
        Створи функцію, яка приймає рядок і повертає новий рядок, у якому всі
        слова з великої літери записані в оберненому порядку.
      </li>

      <li>
        Створи функцію, яка приймає два аргументи - рядок та символ, і повертає
        кількість входжень цього символу в рядок.
      </li>

      <li>
        Створи функцію, яка приймає масив чисел та повертає новий масив, який
        містить лише унікальні числа з вихідного масиву (тобто кожне число в
        новому масиві зустрічається тільки один раз).
      </li>

      <li>
        Створи функцію, яка приймає масив об'єктів з властивістю age та повертає
        середній вік цих об'єктів.
      </li>

      <li>
        Створи функцію, яка приймає масив об'єктів з властивістю price та
        повертає найбільшу ціну з цих об'єктів.
      </li>

      <li>
        Створи функцію, яка приймає масив об'єктів з властивістю name та
        повертає новий масив, який містить тільки ті об'єкти, в яких ім'я
        починається з певної літери.
      </li>

      <li>
        Створи функцію, яка приймає масив чисел та повертає новий масив, в якому
        кожен елемент є квадратом відповідного елемента вхідного масиву.
      </li>

      <li>
        Створи функцію, яка приймає рядок та повертає новий рядок, в якому кожна
        літера перетворена на відповідну їй цифру в ASCII таблиці charCodeAt()
      </li>

      <li>
        Створи функцію, яка приймає масив чисел та повертає новий масив, який
        містить тільки непарні числа з вхідного масиву.
      </li>

      <li>
        Створи функцію, яка приймає два масиви та повертає новий масив, який
        містить всі елементи першого масиву, які не зустрічаються в другому
        масиві.
      </li>

      <li>
        Створи функцію, яка приймає масив об'єктів та повертає новий масив, який
        містить тільки ті об'єкти з вхідного масиву, які мають властивість age
        більшу або дорівнює заданому значенню.
      </li>

      <li>
        Створи функцію, яка приймає рядок та повертає новий рядок, який містить
        тільки унікальні символи з вхідного рядка, в тому ж порядку, в якому
        вони зустрічаються в оригінальному рядку
      </li>

      <li>
        Напиши функцію, яка приймає масив і повертає останній елемент масиву.
        Якщо масив порожній, функція повертає null.
      </li>

      <li>
        Напиши функцію, яка приймає два масиви і повертає новий масив, в якому
        елементи - це сума елементів з однаковими індексами у вхідних масивах.
      </li>

      <li>
        Напиши функцію, яка приймає масив чисел і повертає новий масив, в якому
        елементи - це квадрати чисел з вхідного масиву, відсортовані в порядку
        зростання.
      </li>

      <li>
        Напиши функцію, яка приймає рядок як аргумент та повертає кількість
        голосних літер у рядку.
      </li>

      <li>
        Створи функцію, яка приймає масив чисел та повертає новий масив, який
        містить кожне число вихідного масиву, помножене на 2.
      </li>

      <li>
        Створи функцію, яка приймає масив рядків та повертає новий масив, який
        містить тільки ті рядки, які містять більше 5 символів.
      </li>

      <li>
        Створи функцію, яка приймає масив рядків та повертає новий масив, який
        містить тільки рядки, що починаються з великої літери.
      </li>

      <li>
        Створи функцію, яка приймає масив рядків та повертає новий масив, який
        містить тільки рядки, які містять підрядок "JS".
      </li>

      <li>
        Створи функцію, яка приймає масив чисел та повертає true, якщо масив
        містить послідовність чисел в порядку зростання (наприклад, [1, 2, 3]),
        або false - якщо не містить.
      </li>
    </ul>
</>
  )
}

export default Arrays